Revit 2026 API

# AreaBasedLoadDataDisconnectFromUpstreamNode Method

---

Disconnects from an upstream electrical analytical node.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void DisconnectFromUpstreamNode()
```
```vb
Public Sub DisconnectFromUpstreamNode
```
```cpp
public:
void DisconnectFromUpstreamNode()
```
```fsharp
member DisconnectFromUpstreamNode : unit -> unit
```

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The area based load can not disconnect from the upstream electrical analytical node. |

If the area based load supplies from Node A, Node A is the upstream node of the area based load, and the area based load is the downstream node of node A.

#### Reference

AreaBasedLoadData Class

Autodesk.Revit.DB.Electrical Namespace